// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3
// Console.WriteLine("Введите A= ");
// double A = double.Parse(Console.ReadLine());
// Console.WriteLine("Введите B= ");
// double B = double.Parse(Console.ReadLine());
// if(A>B)
// {
//     Console.WriteLine(A);
// }
// else
// {
//     Console.WriteLine(B);
// }

// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22
Console.WriteLine("Введите A= ");
double A = double.Parse(Console.ReadLine());
Console.WriteLine("Введите B= ");
double B = double.Parse(Console.ReadLine());
Console.WriteLine("Введите C= ");
double C = double.Parse(Console.ReadLine());
double max=A;
if(A> max);
{
    max=A;
}
if(B> max)
{
     max=B;
}

if(C> max)
{
     max=C;
}
Console.WriteLine(max);
// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет

// Console.WriteLine("Введите A= ");
// int A = int.Parse(Console.ReadLine());
// if(A%2==0)
//     Console.WriteLine("Да");
// else
//     Console.WriteLine("Нет");

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// 5 -> 2, 4
// 8 -> 2, 4, 6, 8
// Console.WriteLine("Введите n= ");
// int n = int.Parse(Console.ReadLine());
// int index = 2;
// while(index<=n)
// {
//   Console.WriteLine(index);
//   index=index+2;
// }
